{
    "title": "Treaty of the League of Free and Independent Nations",
    "slug": "league-treaty-1900",
    "adopted": true,
    "adoptedAt": "1872-06-05T00:00:00.000Z",
    "preamble": "The High Contracting Parties, or more simply known as the Parties, compromised of the French Republic, the Union of Soviet Socialist Republics, and the Kingdom of Italy, WISHING to strengthen and formalise the bonds of friendship and cooperation between their States, DETERMINED to defend their sovereignty, independence, and territorial integrity against any threat, RECOGNISING the value of close economic, industrial, and military cooperation for the benefit of their peoples, and AGREEING to coordinate their policies and ambitions beyond Europe, in particular on the continent of Africa,",
    "articles": [
        {
            "order": 1,
            "heading": "Article I. Formation of the League",
            "body": "The High Contracting Parties hereby establish a common League under the name “League of Free and Independent Nations” hereafter referred to simply as “the League”. The purposes of the League are mutual defence, the promotion of economic and industrial cooperation, and the coordination of colonial policy where interests coincide."
        },
        {
            "order": 2,
            "heading": "Article II. Mutual Defence",
            "body": "1. In case of attack by, or imminent threat of attack by, a foreign Power on one or more of the Parties, or in case of danger to their independence, territorial integrity, or political sovereignty in any form, the other Parties will, upon the formal request of the Party or Parties so attacked or imperilled, render assistance immediately.\n2. The above help will comprise but not be limited to the deployment of military and naval troops, the supply of weapons and ammunitions and the exchange of intelligence that is required in the defence of the Party that is under threat.\n3. The extent, scope, and length of this support will be determined through mutual consent between the Parties with regard to the gravity of the threat, the geographical situation, and the abilities of each Party at the time.\n4. The Parties also undertake to consult immediately in case of any event which, in the judgment of one or more Parties, may result in armed conflict between a or multiple Members of the League and another or multiple other states, with the object of affording mutual assistance and preventing armed conflict before it shall have had time to develop.\n5. If a Party is subjected to economic sanctions, blockades, or other hostile economic measures, the other Parties shall, upon request, provide coordinated assistance. This may include supplying essential goods, creating alternative trade routes, and undertaking diplomatic measures. The scope of which shall be agreed upon by all Parties."
        },
        {
            "order": 3,
            "heading": "Article III. No Separate Peace",
            "body": "None of the Parties shall make peace, a truce, or any other agreement with an enemy engaged against the League without the consent of all Parties."
        },
        {
            "order": 4,
            "heading": "Article IV. Military and Technical Cooperation",
            "body": "1. The Parties will exchange officers, engineers, and instructors to share knowledge and training methods.\n2. They will assist each other in acquiring and supplying arms, ammunition, and other military equipment on agreed terms.\n3. The French Republic will make available to the USSR and Italy its most effective military systems and industrial processes.\n4. The USSR and Italy will supply France with raw materials and resources necessary for mutual military and industrial benefit.\n5. The Parties shall organise and conduct joint military and naval exercises no less than once every three years, such exercises to be hosted in rotation among the Parties. The purpose of these exercises shall be to enhance cooperation, improve overall readiness, and strengthen the capacity for combined command and coordinated operations."
        },
        {
            "order": 5,
            "heading": "Article V. Economic and Industrial Development",
            "body": "1. The Parties will promote the introduction of steam-powered and other advanced machinery into agriculture and industry.\n2. They will encourage the improvement of farming tools, cultivation methods, and manufacturing processes.\n3. As far as possible, they will remove restrictions on trade between their territories to facilitate the free movement of goods.\n4. In cases where there is a severe shortage of resources necessary for the survival of peoples residing in one or more of the Parties, all other Parties shall make attempts to cover said shortages in an equitable manner, without undermining their own interests."
        },
        {
            "order": 6,
            "heading": "Article VI. Territorial Expansion and Consultation",
            "body": "1. The Parties will inform and consult one another before undertaking any action to acquire, annex, or otherwise assume sovereignty over any territory, whether by treaty, purchase, occupation, or other means.\n2. They will recognise and respect each other’s agreed spheres of influence.\n3. The Parties will work to avoid rivalry or conflict over matters of territorial, political, or strategic interest.\n4. Such actions shall require the approval of at least two-thirds of all Parties."
        },
        {
            "order": 7,
            "heading": "Article VII. Admission of New Members",
            "body": "1. Any sovereign State may apply to join the League by submitting a formal request to all current Parties.\n2. Admission shall require the unanimous consent of all existing Parties, given in writing.\n3. A State admitted to the League shall accept all obligations of this Treaty and shall enjoy all rights granted to its Members."
        },
        {
            "order": 8,
            "heading": "Article VIII. Withdrawal and Expulsion",
            "body": "1. A Party may withdraw itself out of the League by written notice addressed to all the other Parties at least twelve months before the date on which it intends to withdraw.\n2. The expulsion of a Party may be done when a Party is determined by unanimous consent of all other Parties to have breached the fundamental principles or duties of this Treaty.\n3. Expulsion will become effective three months after notice is given, except by agreement of all other Parties.\n4. Throughout these three months, the Party that wants to withdraw has to continue observing all its obligations."
        },
        {
            "order": 9,
            "heading": "Article IX. Ratification",
            "body": "1. The High Contracting Parties shall ratify this Treaty in accordance with their constitutional processes.\n2. The instruments of ratification shall be exchanged in Paris within three months of the signing of this Treaty."
        },
        {
            "order": 10,
            "heading": "Article X. Language and Depository",
            "body": "1. This Treaty shall be drawn up in the French, Russian, and Italian languages, all three texts being equally authentic.\n2. Additional translations into other languages may be prepared and provided upon request, but such translations shall have no legal effect unless certified by all Parties.\n3. The original signed copy of this Treaty shall be deposited in the archives of the Government of the French Republic, which shall furnish each Party with a certified copy."
        },
        {
            "order": 11,
            "heading": "Article XI. Amendments to the Treaty",
            "body": "1. Any Party can suggest amendments or additions to this Treaty by sending the suggestion in writing to all other Parties.\n2. The proposed amendment or addition shall be discussed in a formal conference, comprised of all Parties convened for that purpose within no more than six months of the proposal being submitted.\n3. Adoption of an amendment or addition will need to be approved by at least two-thirds of all Parties.\n4. Any such amendment or addition so adopted shall come into force within no more than 30 days upon ratification.\n5. The original texts of all amendments or additions adopted shall be deposited together with the original Treaty and shall have equal legal force.\n6. The founding Parties, the French Third Republic, the Union of Soviet Socialist Republics, and the Kingdom of Italy, shall hold a permanent veto over all League decisions. No measure shall pass if opposed by any founding Party."
        },
        {
            "order": 12,
            "heading": "Article XII. On Fair Trade and League Rates",
            "body": "1. No Party shall impose a profit margin exceeding ten percent on the sale of essential commodities within the League, namely:\n(a) coal;\n(b) steel;\n(c) oil;\n(d) grain and other basic foodstuffs.\n2. The Parties shall, wherever possible, give preference to the supply and acquisition of essential goods within the League before seeking such resources from external Powers.\n3. A permanent Commission on Trade and Industry shall be established, composed of delegates from all Parties. The Commission shall:\n(a) oversee the observance of League trade rules;\n(b) publish annual reports on production, prices, and trade flows;\n(c) mediate disputes arising from alleged violations of this Article.\n4. Where there is famine, blockade, or other extraordinary crisis, the Commission may, by a two-thirds vote, order the temporary redistribution of necessities among the Parties, in proportion to need and ability to supply.\n5. No Party shall purchase essential goods from another Party of the League with the sole purpose of reselling such goods at higher prices, whether within the League or to outside Powers. Any such practice shall be deemed a violation of this Treaty and subject to sanction by the Commission on Trade and Industry, in accordance with procedures agreed by the Parties."
        },
        {
            "order": 13,
            "heading": "Article XIII. On Disciplinary Measures",
            "body": "1. Any Party which has been accused, by one or more other Parties, to have violated the obligations of this Treaty shall be subject to investigation by a special Commission of the League, composed of one representative from each other Party. The Commission shall submit its findings within three months.\n2. Upon confirmation of a breach, the League may, by a two-thirds vote of all Parties, impose one or more of the following measures:\n(a) Formal Reprimand: An official censure recorded in the archives of the League;\n(b) Public Disclosure: Publication of the violation and its circumstances in a report circulated to all Parties and, if agreed, made public beyond the League;\n(c) Suspension of Benefits: Temporary suspension of economic, industrial, or military cooperation under Articles IV, V, and XII;\n(d) Restriction of Participation: Loss of voting rights in League commissions, councils, or conferences for a period not exceeding twelve months;\n(e) Financial Penalty: Payment of compensation to the injured Party or to a common League fund;\n(f) Trade Limitations: Imposition of restrictions on preferential trade or tariffs otherwise granted under League agreements;\n(g) Suspension of Military Assistance: Withholding of arms, munitions, instructors, or other forms of defence cooperation until compliance is restored;\n(h) Suspension of League Offices: temporary removal of the offending Party’s representatives from chairmanships or commissions;\n(i) Quotas or Restrictions: Imposition of limits on the Party’s access to shared resources or projects of the League;\n(j) Expulsion: In the case of grave and repeated violations, as already provided under Article VIII, Clause 2.\n3. A Party under sanction shall remain bound by all other obligations of this Treaty during the period of disciplinary measures, unless expressly released from them by unanimous agreement of the other Parties.\n4. Rights and privileges suspended under this Article shall be restored immediately upon the completion of the sanction period or upon the decision of the League."
        },
        {
            "order": 14,
            "heading": "Article XIV. On Human Dignity and the Rights of Peoples",
            "body": "1. The High Contracting Parties affirm that the independence, sovereignty, and equality of all nations, whether great or small, are principles to be respected. No Party shall pursue conquest or annexation for the purpose of domination or subjugation. Territorial changes may, however, result from peace treaties following a defensive war, or from the clearly expressed will of the peoples concerned, subject to consultation and approval under the procedures of this Treaty.\n2. The High Contracting Parties jointly condemn slavery, the trade in human beings, and all practices that treat persons as property. They pledge, each within their power, to oppose such practices wherever encountered and to support efforts aimed at their gradual and universal abolition.\n3. No Party shall, in the conduct of war or in the administration of occupied territory, commit acts of deliberate cruelty, extermination, or devastation against civilian populations. The deliberate destruction of towns, villages, harvests, or means of subsistence, not justified by direct military necessity, shall be considered contrary to this Treaty.\n4. The High Contracting Parties undertake to uphold the principle that all peoples, within the territories under their authority, shall be allowed the pursuit of livelihood, the practice of religion, and the preservation of language and culture, subject only to such limitations as are required for public order and the common welfare.\n5. Any violation of this Article, once established by the procedures of Article XIII, shall be deemed a breach of the fundamental spirit of the League, and may result in the measures provided therein.\n6. The High Contracting Parties affirm that doctrines or policies which seek the systematic persecution, exclusion, or extermination of peoples by reason of their race, faith, language, or class are incompatible with the spirit of this Treaty. No Party shall permit such doctrines to govern its laws or conduct, and their adoption shall be deemed a breach of this Treaty."
        }
    ]
}